lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
#include "./BSP/LVGL/slave_ui.h"
#include "./BSP/ADC/adc.h"
#include "power_meter.h"
#include "power_meter_storage.h"

#include <stdio.h>
#include <string.h>
#include <math.h>
#include "stm32h7xx_hal.h"

extern const lv_font_t lv_font_chinese_14;

#define SLAVE_STATION_COUNT       8U
#define SMS_TEXT_MAX              96U
#define PYNQ_TEXT_MAX             128U
#define PYNQ_LOG_LINES            20U
#define PYNQ_LOG_LINE_MAX         160U
#define WAVE_POINT_COUNT          160U
#define ADC_REF_MV                3300U
#define ADC_FULL_SCALE            65535U
#define WAVE_INPUT_CAL_NUM        5U
#define WAVE_INPUT_CAL_DEN        6U
#define WAVE_SAMPLE_RATE_HZ       (adc_dma_get_sample_rate_hz())
#define WAVE_FREQ_MAX_HZ          10000U
#define WAVE_LOW_FREQ_LIMIT_HZ    2200U
#define WAVE_LOW_FREQ_AVG_SHIFT   5U
#define WAVE_FREQ_DISPLAY_MS      900U
#define WAVE_LOW_FREQ_BUF_SIZE    4096U
#define WAVE_LOW_FREQ_ESTIMATE_MS 80U
#define WAVE_LOW_FREQ_MIN_HZ      100U
#define WAVE_UI_UPDATE_MS         200U
#define WAVE_DRAW_ENABLE          0
#define WAVE_MIN_SPAN_RAW         256U

typedef enum {
    PAGE_POWER = 0,
    /* Legacy page renderers remain compiled below but have no visible entry. */
    PAGE_HOME,
    PAGE_RX,
    PAGE_SMS,
    PAGE_SETUP,
    PAGE_SCOPE,
    PAGE_COUNT
} slave_page_t;

typedef struct {
    uint8_t station_id;
    bool group_enabled;
    bool carrier_detected;
    bool selected_call;
    bool group_call;
    bool muted;
    uint8_t volume;
    uint8_t squelch;
    uint8_t af_level;
    int16_t rssi_dbm;
    uint16_t battery_mv;
    uint8_t battery_percent;
    uint32_t packet_count;
    uint8_t last_sender;
    char sms_text[SMS_TEXT_MAX];
    char pynq_status[PYNQ_TEXT_MAX];
    char test_result[PYNQ_TEXT_MAX];
    char capture_state[PYNQ_TEXT_MAX];
    char log_lines[PYNQ_LOG_LINES][PYNQ_LOG_LINE_MAX];
    uint8_t log_count;
    uint16_t wave_min;
    uint16_t wave_max;
    uint16_t wave_avg;
    uint16_t wave_pp_mv;
    uint32_t wave_freq_x10;
    uint32_t wave_freq_calc_x10;
    uint64_t wave_freq_sum_x10;
    uint32_t wave_freq_last_ms;
    uint16_t wave_freq_sample_count;
    uint32_t wave_low_freq_last_ms;
    uint32_t wave_frame_count;
    uint64_t wave_abs_sample;
    uint64_t wave_last_cross_x100;
    uint64_t wave_period_avg_x100;
    bool wave_freq_valid;
    bool wave_freq_calc_valid;
    bool wave_above_high;
} slave_ui_state_t;

typedef struct {
    lv_obj_t *root;
    lv_obj_t *top;
    lv_obj_t *status;
    lv_obj_t *content;
    lv_obj_t *nav_btn[PAGE_COUNT];
    lv_obj_t *label_rx;
    lv_obj_t *label_id;
    lv_obj_t *label_batt;
    lv_obj_t *label_rssi;
    lv_obj_t *label_uptime;
    lv_obj_t *label_status;
    lv_obj_t *label_station_value;
    lv_obj_t *label_group_value;
    lv_obj_t *label_wave_info;
    lv_obj_t *label_pm_debug;
    lv_obj_t *label_pm_power;
    lv_obj_t *label_pm_wavelength;
    lv_obj_t *label_pm_main;
    lv_obj_t *label_pm_range;
    lv_obj_t *label_pm_afe;
    lv_obj_t *label_pm_status;
    lv_obj_t *label_pm_hint;
    lv_obj_t *btn_pm_linear;
    lv_obj_t *btn_pm_unit;
    lv_obj_t *btn_pm_auto;
    lv_obj_t *btn_pm_range[3];
    lv_obj_t *zero_confirm_overlay;
    lv_obj_t *cal_overlay;
    lv_obj_t *label_cal_input;
    lv_obj_t *label_cal_wave;
    lv_obj_t *label_cal_status;
    lv_obj_t *label_cal_afe;
    lv_obj_t *label_cal_raw_power;
    lv_obj_t *label_cal_current_range;
    lv_obj_t *label_cal_gain;
    lv_obj_t *label_cal_points;
    lv_obj_t *btn_cal_range[3];
    lv_obj_t *label_pynq_status;
    lv_obj_t *label_test_result;
    lv_obj_t *label_capture_state;
    lv_obj_t *label_sms_body;
    lv_obj_t *label_log;
    lv_obj_t *wave_line;
    lv_obj_t *bar_af;
    lv_obj_t *bar_rssi;
    lv_point_precise_t wave_points[WAVE_POINT_COUNT];
    slave_page_t page;
    bool pm_show_dbm;
    bool pm_show_uW;
    bool zero_save_handled;
    bool zero_save_failed;
    pm_range_t cal_range;
    char cal_input[16];
    pm_power_parameters_t zero_backup;
    pm_power_parameters_t cal_backup;
    slave_ui_state_t state;
} slave_ui_t;

static slave_ui_t g_ui;
static pm_display_mode_t g_pm_start_display_mode = PM_DISPLAY_MODE_MW;
static uint16_t g_wave_low_freq_buf[WAVE_LOW_FREQ_BUF_SIZE];
static uint16_t g_wave_low_freq_len = 0U;
static void (*g_command_callback)(const char *command) = NULL;

#define C_BG        lv_color_hex(0x0F1419)
#define C_PANEL     lv_color_hex(0x172028)
#define C_PANEL_2   lv_color_hex(0x1F2A33)
#define C_LINE      lv_color_hex(0x344450)
#define C_TEXT      lv_color_hex(0xF4F7FA)
#define C_MUTED     lv_color_hex(0x9DAAB5)
#define C_ACCENT    lv_color_hex(0x42C6E8)
#define C_WARN      lv_color_hex(0xF2C24B)
#define C_OK        lv_color_hex(0x64D48E)
#define C_BAD       lv_color_hex(0xE96666)

static void render_page(slave_page_t page);
static void command_button_event(lv_event_t *event);
static void update_pynq_labels(void);
static void push_frequency_sample(uint32_t freq_x10);
static void append_low_frequency_samples(const uint16_t *samples, uint16_t count);
static uint32_t estimate_low_frequency_x10(uint32_t hint_freq_x10);
static void reset_frequency_display(void);
static void update_power_meter_ui(lv_timer_t *timer);
static void pm_manual_event(lv_event_t *event);
static void pm_zero_ui_service(void);
static void pm_cal_update_dialog(void);

static lv_obj_t *make_obj(lv_obj_t *parent, int32_t x, int32_t y, int32_t w, int32_t h, lv_color_t bg)
{
    lv_obj_t *obj = lv_obj_create(parent);
    lv_obj_set_pos(obj, x, y);
    lv_obj_set_size(obj, w, h);
    lv_obj_set_style_bg_color(obj, bg, 0);
    lv_obj_set_style_bg_opa(obj, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(obj, 0, 0);
    lv_obj_set_style_pad_all(obj, 0, 0);
    lv_obj_clear_flag(obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_scrollbar_mode(obj, LV_SCROLLBAR_MODE_OFF);
    return obj;
}

static lv_obj_t *make_label(lv_obj_t *parent,
                            const char *text,
                            int32_t x,
                            int32_t y,
                            const lv_font_t *font,
                            lv_color_t color)
{
    lv_obj_t *label = lv_label_create(parent);
    lv_label_set_text(label, text);
    lv_obj_set_pos(label, x, y);
    lv_obj_set_style_text_color(label, color, 0);
    if (font != NULL) {
        lv_obj_set_style_text_font(label, font, 0);
    }
    return label;
}

static lv_obj_t *make_panel(lv_obj_t *parent, int32_t x, int32_t y, int32_t w, int32_t h, const char *title)
{
    lv_obj_t *panel = make_obj(parent, x, y, w, h, C_PANEL);
    lv_obj_set_style_radius(panel, 6, 0);
    lv_obj_set_style_border_width(panel, 1, 0);
    lv_obj_set_style_border_color(panel, C_LINE, 0);
    if (title != NULL) {
        make_label(panel, title, 10, 8, &lv_font_chinese_14, C_MUTED);
        make_obj(panel, 10, 31, w - 20, 1, C_LINE);
    }
    return panel;
}

static lv_obj_t *make_button(lv_obj_t *parent,
                             const char *text,
                             int32_t x,
                             int32_t y,
                             int32_t w,
                             int32_t h,
                             lv_color_t bg,
                             lv_event_cb_t cb)
{
    lv_obj_t *btn = lv_button_create(parent);
    lv_obj_set_pos(btn, x, y);
    lv_obj_set_size(btn, w, h);
    lv_obj_set_style_bg_color(btn, bg, 0);
    lv_obj_set_style_radius(btn, 5, 0);
    lv_obj_set_style_shadow_width(btn, 0, 0);
    lv_obj_set_style_border_width(btn, 1, 0);
    lv_obj_set_style_border_color(btn, C_LINE, 0);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);
    if (cb != NULL) {
        lv_obj_add_event_cb(btn, cb, LV_EVENT_CLICKED, NULL);
    }

    lv_obj_t *label = lv_label_create(btn);
    lv_label_set_text(label, text);
    lv_obj_set_style_text_color(label, C_TEXT, 0);
    lv_obj_set_style_text_font(label, &lv_font_chinese_14, 0);
    lv_obj_center(label);
    return btn;
}

