lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
static void set_button_selected(lv_obj_t *button, bool selected)
{
    if (button == NULL) { return; }
    lv_obj_set_style_bg_color(button, selected ? C_ACCENT : C_PANEL_2, 0);
    lv_obj_t *label = lv_obj_get_child(button, 0);
    if (label != NULL) {
        lv_obj_set_style_text_color(label, selected ? C_BG : C_TEXT, 0);
    }
}

static lv_obj_t *make_value_card(lv_obj_t *parent,
                                 int32_t x,
                                 int32_t y,
                                 int32_t w,
                                 int32_t h,
                                 const char *name,
                                 const char *value,
                                 lv_color_t color)
{
    lv_obj_t *panel = make_panel(parent, x, y, w, h, NULL);
    make_label(panel, name, 10, 8, &lv_font_montserrat_14, C_MUTED);
    lv_obj_t *label = make_label(panel, value, 10, 32, &lv_font_montserrat_18, color);
    lv_obj_set_width(label, w - 20);
    lv_label_set_long_mode(label, LV_LABEL_LONG_CLIP);
    return panel;
}

static lv_obj_t *make_row(lv_obj_t *parent, int32_t y, const char *name, const char *value, lv_color_t color)
{
    make_label(parent, name, 12, y, &lv_font_montserrat_14, C_MUTED);
    lv_obj_t *label = make_label(parent, value, 118, y, &lv_font_montserrat_14, color);
    lv_obj_set_width(label, 170);
    lv_label_set_long_mode(label, LV_LABEL_LONG_CLIP);
    return label;
}

static uint16_t raw_to_mv(uint16_t raw)
{
    uint32_t adc_mv = (uint32_t)(((uint64_t)raw * ADC_REF_MV + (ADC_FULL_SCALE / 2U)) / ADC_FULL_SCALE);

    return (uint16_t)((adc_mv * WAVE_INPUT_CAL_NUM + (WAVE_INPUT_CAL_DEN / 2U)) / WAVE_INPUT_CAL_DEN);
}

static int32_t rssi_to_percent(int16_t dbm)
{
    if (dbm <= -120) {
        return 0;
    }
    if (dbm >= -40) {
        return 100;
    }
    return ((int32_t)dbm + 120) * 100 / 80;
}

static const char *rx_status_text(void)
{
    if (!g_ui.state.carrier_detected) {
        return "IDLE";
    }
    if (g_ui.state.selected_call) {
        return g_ui.state.group_call ? "GROUP" : "CALL";
    }
    return "CARRIER";
}

static void update_top(void)
{
    char buf[40];
    lv_color_t rx_color = g_ui.state.selected_call ? C_OK :
                          (g_ui.state.carrier_detected ? C_WARN : C_BAD);

    if (g_ui.label_rx != NULL) {
        lv_label_set_text(g_ui.label_rx, rx_status_text());
        lv_obj_set_style_text_color(g_ui.label_rx, rx_color, 0);
    }

    if (g_ui.label_id != NULL) {
        snprintf(buf, sizeof(buf), "ID:%u", g_ui.state.station_id);
        lv_label_set_text(g_ui.label_id, buf);
    }

    if (g_ui.label_batt != NULL) {
        snprintf(buf, sizeof(buf), "BAT:%u%%", g_ui.state.battery_percent);
        lv_label_set_text(g_ui.label_batt, buf);
        lv_obj_set_style_text_color(g_ui.label_batt,
                                    g_ui.state.battery_percent < 20U ? C_BAD : C_OK,
                                    0);
    }

    if (g_ui.label_rssi != NULL) {
        snprintf(buf, sizeof(buf), "%ddBm", (int)g_ui.state.rssi_dbm);
        lv_label_set_text(g_ui.label_rssi, buf);
    }

    if (g_ui.label_station_value != NULL) {
        snprintf(buf, sizeof(buf), "%u", g_ui.state.station_id);
        lv_label_set_text(g_ui.label_station_value, buf);
    }

    if (g_ui.label_group_value != NULL) {
        lv_label_set_text(g_ui.label_group_value, g_ui.state.group_enabled ? "ON" : "OFF");
        lv_obj_set_style_text_color(g_ui.label_group_value,
                                    g_ui.state.group_enabled ? C_OK : C_WARN,
                                    0);
    }

    if (g_ui.bar_af != NULL) {
        lv_bar_set_value(g_ui.bar_af, g_ui.state.af_level, LV_ANIM_OFF);
    }

    if (g_ui.bar_rssi != NULL) {
        lv_bar_set_value(g_ui.bar_rssi, rssi_to_percent(g_ui.state.rssi_dbm), LV_ANIM_OFF);
    }
}

static void station_minus_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.state.station_id == 0U) {
        g_ui.state.station_id = SLAVE_STATION_COUNT - 1U;
    } else {
        g_ui.state.station_id--;
    }
    update_top();
}

static void station_plus_event(lv_event_t *event)
{
    (void)event;
    g_ui.state.station_id = (uint8_t)((g_ui.state.station_id + 1U) % SLAVE_STATION_COUNT);
    update_top();
}

static void group_toggle_event(lv_event_t *event)
{
    (void)event;
    g_ui.state.group_enabled = !g_ui.state.group_enabled;
    update_top();
    render_page(PAGE_SETUP);
}

static void mute_toggle_event(lv_event_t *event)
{
    (void)event;
    g_ui.state.muted = !g_ui.state.muted;
    render_page(g_ui.page);
}

static void volume_minus_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.state.volume >= 5U) {
        g_ui.state.volume -= 5U;
    }
    render_page(g_ui.page);
}

static void volume_plus_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.state.volume <= 95U) {
        g_ui.state.volume += 5U;
    }
    render_page(g_ui.page);
}

static void sms_clear_event(lv_event_t *event)
{
    (void)event;
    g_ui.state.sms_text[0] = '\0';
    render_page(PAGE_SMS);
}

static void simulate_call_event(lv_event_t *event)
{
    (void)event;
    g_ui.state.carrier_detected = true;
    g_ui.state.selected_call = true;
    g_ui.state.group_call = false;
    g_ui.state.rssi_dbm = -62;
    g_ui.state.af_level = 58;
    update_top();
    render_page(PAGE_HOME);
}

static void command_button_event(lv_event_t *event)
{
    const char *command = (const char *)lv_event_get_user_data(event);

    if (command == NULL) {
        return;
    }

    snprintf(g_ui.state.capture_state, sizeof(g_ui.state.capture_state), "%s sent", command);
    slave_ui_append_log(command);
    update_pynq_labels();

    if (g_command_callback != NULL) {
        g_command_callback(command);
    }
}

static void update_nav(void)
{
    for (uint8_t i = 0; i < PAGE_COUNT; i++) {
        if (g_ui.nav_btn[i] == NULL) { continue; }
        lv_color_t bg = (i == (uint8_t)g_ui.page) ? C_ACCENT : C_PANEL_2;
        lv_color_t fg = (i == (uint8_t)g_ui.page) ? C_BG : C_TEXT;
        lv_obj_set_style_bg_color(g_ui.nav_btn[i], bg, 0);
        lv_obj_set_style_text_color(lv_obj_get_child(g_ui.nav_btn[i], 0), fg, 0);
    }
}

static void update_pynq_labels(void)
{
    if (g_ui.label_pynq_status != NULL) {
        lv_label_set_text(g_ui.label_pynq_status,
                          g_ui.state.pynq_status[0] ? g_ui.state.pynq_status : "BOOT WAIT");
    }

    if (g_ui.label_test_result != NULL) {
        lv_label_set_text(g_ui.label_test_result,
                          g_ui.state.test_result[0] ? g_ui.state.test_result : "--");
    }

    if (g_ui.label_capture_state != NULL) {
        lv_label_set_text(g_ui.label_capture_state,
                          g_ui.state.capture_state[0] ? g_ui.state.capture_state : "IDLE");
    }

    if (g_ui.label_sms_body != NULL) {
        lv_label_set_text(g_ui.label_sms_body,
                          g_ui.state.sms_text[0] ? g_ui.state.sms_text : "(waiting for PYNQ SMS)");
        lv_obj_set_style_text_color(g_ui.label_sms_body,
                                    g_ui.state.sms_text[0] ? C_TEXT : C_MUTED,
                                    0);
    }

    if (g_ui.label_log != NULL) {
        char joined[(PYNQ_LOG_LINES * (PYNQ_LOG_LINE_MAX + 1U))];
        size_t pos = 0U;

