lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
        joined[0] = '\0';
        for (uint8_t i = 0; i < g_ui.state.log_count; i++) {
            int written = snprintf(&joined[pos], sizeof(joined) - pos,
                                   "%s%s",
                                   g_ui.state.log_lines[i],
                                   (i + 1U < g_ui.state.log_count) ? "\n" : "");
            if (written <= 0) {
                break;
            }
            if ((size_t)written >= sizeof(joined) - pos) {
                pos = sizeof(joined) - 1U;
                break;
            }
            pos += (size_t)written;
        }

        if (joined[0] == '\0') {
            snprintf(joined, sizeof(joined), "waiting for PYNQ...");
        }
        lv_label_set_text(g_ui.label_log, joined);
    }
}

static void render_home(void)
{
    lv_obj_t *c = g_ui.content;
    char value[40];

    make_value_card(c, 8, 8, 186, 76, "Frequency", "35.000 MHz", C_ACCENT);
    make_value_card(c, 202, 8, 186, 76, "RX State", rx_status_text(),
                    g_ui.state.selected_call ? C_OK : C_WARN);

    snprintf(value, sizeof(value), "S%u%s", g_ui.state.station_id,
             g_ui.state.group_enabled ? " + GRP" : "");
    make_value_card(c, 396, 8, 186, 76, "Address", value, C_TEXT);

    snprintf(value, sizeof(value), "%u%%", g_ui.state.battery_percent);
    make_value_card(c, 590, 8, 202, 76, "Battery", value,
                    g_ui.state.battery_percent < 20U ? C_BAD : C_OK);

    lv_obj_t *rx = make_panel(c, 8, 94, 380, 250, "Receive Monitor");
    g_ui.bar_rssi = lv_bar_create(rx);
    lv_obj_set_pos(g_ui.bar_rssi, 18, 58);
    lv_obj_set_size(g_ui.bar_rssi, 248, 22);
    lv_bar_set_range(g_ui.bar_rssi, 0, 100);
    lv_obj_set_style_bg_color(g_ui.bar_rssi, C_PANEL_2, 0);
    lv_obj_set_style_bg_color(g_ui.bar_rssi, C_ACCENT, LV_PART_INDICATOR);
    make_label(rx, "RSSI", 286, 59, &lv_font_montserrat_14, C_MUTED);

    g_ui.bar_af = lv_bar_create(rx);
    lv_obj_set_pos(g_ui.bar_af, 18, 112);
    lv_obj_set_size(g_ui.bar_af, 248, 22);
    lv_bar_set_range(g_ui.bar_af, 0, 100);
    lv_obj_set_style_bg_color(g_ui.bar_af, C_PANEL_2, 0);
    lv_obj_set_style_bg_color(g_ui.bar_af, C_OK, LV_PART_INDICATOR);
    make_label(rx, "AF", 286, 113, &lv_font_montserrat_14, C_MUTED);

    make_row(rx, 156, "Demod", "AM audio", C_TEXT);
    make_row(rx, 184, "Audio out", g_ui.state.muted ? "Muted" : "Headphone", g_ui.state.muted ? C_WARN : C_OK);
    make_row(rx, 212, "Data", "AFSK 100bps", C_TEXT);

    lv_obj_t *msg = make_panel(c, 396, 94, 396, 250, "Last Message");
    if (g_ui.state.group_call) {
        snprintf(value, sizeof(value), "From: ALL (group)");
    } else {
        snprintf(value, sizeof(value), "From: S%u", g_ui.state.last_sender);
    }
    make_label(msg, value, 14, 48, &lv_font_montserrat_14, C_MUTED);

    lv_obj_t *sms = make_label(msg,
                               g_ui.state.sms_text[0] ? g_ui.state.sms_text : "(no received SMS)",
                               14, 82,
                               &lv_font_montserrat_18,
                               g_ui.state.sms_text[0] ? C_TEXT : C_MUTED);
    lv_obj_set_width(sms, 360);
    lv_label_set_long_mode(sms, LV_LABEL_LONG_WRAP);
    snprintf(value, sizeof(value), "%lu", (unsigned long)g_ui.state.packet_count);
    make_row(msg, 190, "Packets", value, C_TEXT);
    make_button(msg, g_ui.state.muted ? "UNMUTE" : "MUTE", 14, 202, 110, 34,
                g_ui.state.muted ? C_WARN : C_PANEL_2, mute_toggle_event);

    update_top();
}

static void render_rx(void)
{
    lv_obj_t *c = g_ui.content;
    char value[40];

    lv_obj_t *left = make_panel(c, 8, 8, 384, 336, "Voice Receive");
    make_row(left, 48, "Carrier", g_ui.state.carrier_detected ? "Detected" : "Idle",
             g_ui.state.carrier_detected ? C_OK : C_MUTED);
    make_row(left, 78, "Selected", g_ui.state.selected_call ? "Yes" : "No",
             g_ui.state.selected_call ? C_OK : C_WARN);
    make_row(left, 108, "Call type", g_ui.state.group_call ? "Group" : "Station", C_TEXT);
    make_row(left, 138, "Headphone", g_ui.state.muted ? "Muted" : "Enabled",
             g_ui.state.muted ? C_WARN : C_OK);

    snprintf(value, sizeof(value), "%u%%", g_ui.state.volume);
    make_row(left, 168, "Volume", value, C_TEXT);
    make_button(left, "-", 18, 204, 58, 42, C_PANEL_2, volume_minus_event);
    make_button(left, "+", 90, 204, 58, 42, C_PANEL_2, volume_plus_event);
    make_button(left, g_ui.state.muted ? "UNMUTE" : "MUTE", 166, 204, 120, 42,
                g_ui.state.muted ? C_WARN : C_PANEL_2, mute_toggle_event);

    lv_obj_t *bar = lv_bar_create(left);
    lv_obj_set_pos(bar, 18, 272);
    lv_obj_set_size(bar, 320, 24);
    lv_bar_set_range(bar, 0, 100);
    lv_bar_set_value(bar, g_ui.state.af_level, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(bar, C_PANEL_2, 0);
    lv_obj_set_style_bg_color(bar, C_OK, LV_PART_INDICATOR);
    make_label(left, "AF level", 18, 250, &lv_font_montserrat_14, C_MUTED);

    lv_obj_t *right = make_panel(c, 400, 8, 392, 336, "Receiver Chain");
    make_row(right, 48, "RF band", "30-40 MHz", C_OK);
    make_row(right, 78, "RX freq", "35.000 MHz", C_ACCENT);
    make_row(right, 108, "Antenna", "<= 1m", C_OK);
    make_row(right, 138, "Demod", "AM envelope", C_TEXT);
    make_row(right, 168, "SMS modem", "AFSK 1200/2200", C_TEXT);
    make_row(right, 198, "Squelch", "Manual", C_WARN);
    make_row(right, 228, "Distance", ">= 5m target", C_WARN);
    make_button(right, "SIM CALL", 18, 276, 130, 42, C_ACCENT, simulate_call_event);
}

static void render_sms(void)
{
    lv_obj_t *c = g_ui.content;
    char value[48];
    int32_t content_w = lv_obj_get_width(c);
    int32_t content_h = lv_obj_get_height(c);
    if (content_w <= 0) { content_w = 800; }
    if (content_h <= 0) { content_h = 340; }

    /* Three-column layout: Control | SMS Inbox | Log */
    int32_t pad = 6;
    int32_t ctrl_w = 180;
    int32_t inbox_w = 260;
    int32_t log_w = content_w - ctrl_w - inbox_w - pad * 4;
    if (log_w < 200) { log_w = 200; }

    int32_t ctrl_x = pad;
    int32_t inbox_x = ctrl_x + ctrl_w + pad;
    int32_t log_x = inbox_x + inbox_w + pad;
    int32_t panel_h = content_h - pad * 2;
    int32_t log_inner_w = log_w - 20;

    /* ---- PYNQ Control (left) ---- */
    lv_obj_t *control = make_panel(c, ctrl_x, pad, ctrl_w, panel_h, "PYNQ Control");
    lv_obj_t *btn;
    make_label(control, "UART1 115200", 10, 38, &lv_font_montserrat_14, C_MUTED);
    btn = make_button(control, "STATUS", 10, 68, 72, 36, C_PANEL_2, NULL);
    lv_obj_add_event_cb(btn, command_button_event, LV_EVENT_CLICKED, "STATUS");
    btn = make_button(control, "TEST", 90, 68, 72, 36, C_PANEL_2, NULL);
    lv_obj_add_event_cb(btn, command_button_event, LV_EVENT_CLICKED, "TEST");
    btn = make_button(control, "CAPTURE", 10, 116, 152, 42, C_ACCENT, NULL);
    lv_obj_add_event_cb(btn, command_button_event, LV_EVENT_CLICKED, "CAPTURE");
    make_button(control, "CLEAR", 10, panel_h - 58, 80, 36, C_WARN, sms_clear_event);

    lv_obj_t *state = make_panel(control, 10, 172, ctrl_w - 28, 72, NULL);
    g_ui.label_capture_state = make_label(state, "IDLE", 8, 8, &lv_font_montserrat_14, C_TEXT);
    lv_obj_set_width(g_ui.label_capture_state, ctrl_w - 44);
    lv_label_set_long_mode(g_ui.label_capture_state, LV_LABEL_LONG_CLIP);
    g_ui.label_test_result = make_label(state, "--", 8, 34, &lv_font_montserrat_14, C_ACCENT);
    lv_obj_set_width(g_ui.label_test_result, ctrl_w - 44);
    lv_label_set_long_mode(g_ui.label_test_result, LV_LABEL_LONG_CLIP);

    /* ---- SMS Inbox (middle) ---- */
    lv_obj_t *inbox = make_panel(c, inbox_x, pad, inbox_w, panel_h, "SMS Characters");
    if (g_ui.state.group_call) {
        snprintf(value, sizeof(value), "Addr: ALL (group)");
    } else {
        snprintf(value, sizeof(value), "Addr: S%u", g_ui.state.last_sender);
    }
    make_label(inbox, value, 12, 40, &lv_font_montserrat_14, C_MUTED);

    lv_obj_t *body = make_panel(inbox, 12, 70, inbox_w - 32, panel_h - 88, NULL);
    g_ui.label_sms_body = make_label(body,
                                     g_ui.state.sms_text[0] ? g_ui.state.sms_text : "(waiting for PYNQ SMS)",
                                     10, 10,
                                     &lv_font_montserrat_18,
                                     g_ui.state.sms_text[0] ? C_TEXT : C_MUTED);
    lv_obj_set_width(g_ui.label_sms_body, inbox_w - 52);
    lv_label_set_long_mode(g_ui.label_sms_body, LV_LABEL_LONG_WRAP);

    /* ---- PYNQ Log (right, scrollable, wide) ---- */
    lv_obj_t *log = make_panel(c, log_x, pad, log_w, panel_h, "PYNQ Log");
    g_ui.label_pynq_status = make_label(log, "BOOT WAIT", 10, 38, &lv_font_montserrat_14, C_ACCENT);
    lv_obj_set_width(g_ui.label_pynq_status, log_inner_w);
    lv_label_set_long_mode(g_ui.label_pynq_status, LV_LABEL_LONG_CLIP);

