lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    /* Scrollable log body — label auto-expands, parent scrolls */
    lv_obj_t *log_body = lv_obj_create(log);
    lv_obj_set_pos(log_body, 8, 68);
    lv_obj_set_size(log_body, log_inner_w + 8, panel_h - 84);
    lv_obj_set_style_bg_color(log_body, C_PANEL, 0);
    lv_obj_set_style_bg_opa(log_body, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(log_body, 0, 0);
    lv_obj_set_style_pad_all(log_body, 4, 0);
    lv_obj_set_scrollbar_mode(log_body, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_add_flag(log_body, LV_OBJ_FLAG_SCROLLABLE);

    g_ui.label_log = make_label(log_body, "waiting for PYNQ...", 4, 4, &lv_font_montserrat_14, C_TEXT);
    lv_obj_set_width(g_ui.label_log, log_inner_w);
    lv_label_set_long_mode(g_ui.label_log, LV_LABEL_LONG_WRAP);

    update_pynq_labels();
}

static void render_setup(void)
{
    lv_obj_t *c = g_ui.content;
    char value[40];

    lv_obj_t *addr = make_panel(c, 8, 8, 384, 336, "Station Address");
    make_label(addr, "Station ID", 20, 54, &lv_font_montserrat_14, C_MUTED);
    g_ui.label_station_value = make_label(addr, "0", 154, 48, &lv_font_montserrat_18, C_ACCENT);
    make_button(addr, "-", 20, 92, 72, 48, C_PANEL_2, station_minus_event);
    make_button(addr, "+", 110, 92, 72, 48, C_PANEL_2, station_plus_event);
    make_label(addr, "Range: S0-S7", 204, 108, &lv_font_montserrat_14, C_MUTED);

    make_label(addr, "Accept group call", 20, 174, &lv_font_montserrat_14, C_MUTED);
    g_ui.label_group_value = make_label(addr, "ON", 184, 174, &lv_font_montserrat_18, C_OK);
    make_button(addr, "TOGGLE", 20, 214, 140, 42, C_PANEL_2, group_toggle_event);
    lv_obj_t *note = make_label(addr, "Save ID in RF/config layer.", 20, 286, &lv_font_montserrat_14, C_WARN);
    lv_obj_set_width(note, 340);
    lv_label_set_long_mode(note, LV_LABEL_LONG_WRAP);

    lv_obj_t *sys = make_panel(c, 400, 8, 392, 336, "System Checklist");
    snprintf(value, sizeof(value), "%umV / %u%%", g_ui.state.battery_mv, g_ui.state.battery_percent);
    make_row(sys, 48, "Battery", value, g_ui.state.battery_percent < 20U ? C_BAD : C_OK);
    make_row(sys, 78, "Power", "Battery only", C_OK);
    make_row(sys, 108, "Audio out", "Headphone", C_OK);
    make_row(sys, 138, "RX freq", "Match master", C_ACCENT);
    make_row(sys, 168, "Direct test", "20dB attenuator", C_WARN);
    make_row(sys, 198, "Antenna", "<= 1m", C_OK);
    make_row(sys, 228, "RF decode", "TODO", C_WARN);
    make_row(sys, 258, "SMS parser", "TODO", C_WARN);
}

static void update_waveform_obj(void)
{
    static uint32_t last_update_ms = 0U;
    char info[112];
    char freq[24];
    uint32_t now = HAL_GetTick();

#if WAVE_DRAW_ENABLE
    if (g_ui.wave_line != NULL) {
        lv_line_set_points_mutable(g_ui.wave_line, g_ui.wave_points, WAVE_POINT_COUNT);
    }
#endif

    if (g_ui.label_wave_info != NULL) {
        if (last_update_ms != 0U && (now - last_update_ms) < WAVE_UI_UPDATE_MS) {
            return;
        }
        last_update_ms = now;

        if (g_ui.state.wave_freq_valid) {
            snprintf(freq, sizeof(freq), "%lu.%luHz",
                     (unsigned long)(g_ui.state.wave_freq_x10 / 10U),
                     (unsigned long)(g_ui.state.wave_freq_x10 % 10U));
        } else {
            snprintf(freq, sizeof(freq), "--.-Hz");
        }

        snprintf(info, sizeof(info), "Freq %s  Vpp %umV  Min %umV  Max %umV  Frames %lu",
                 freq,
                 g_ui.state.wave_pp_mv,
                 raw_to_mv(g_ui.state.wave_min),
                 raw_to_mv(g_ui.state.wave_max),
                 (unsigned long)g_ui.state.wave_frame_count);
        lv_label_set_text(g_ui.label_wave_info, info);
    }
}

static void push_frequency_sample(uint32_t freq_x10)
{
    uint32_t now = HAL_GetTick();

    g_ui.state.wave_freq_sum_x10 += freq_x10;
    if (g_ui.state.wave_freq_sample_count < 65535U) {
        g_ui.state.wave_freq_sample_count++;
    }

    if (g_ui.state.wave_freq_last_ms == 0U) {
        g_ui.state.wave_freq_last_ms = now;
    }

    if ((now - g_ui.state.wave_freq_last_ms) >= WAVE_FREQ_DISPLAY_MS &&
        g_ui.state.wave_freq_sample_count > 0U) {
        g_ui.state.wave_freq_x10 =
            (uint32_t)((g_ui.state.wave_freq_sum_x10 +
                        (g_ui.state.wave_freq_sample_count / 2U)) /
                       g_ui.state.wave_freq_sample_count);
        g_ui.state.wave_freq_valid = true;
        g_ui.state.wave_freq_sum_x10 = 0U;
        g_ui.state.wave_freq_sample_count = 0U;
        g_ui.state.wave_freq_last_ms = now;
    }
}

static void append_low_frequency_samples(const uint16_t *samples, uint16_t count)
{
    uint16_t copy_count = count;

    if (samples == NULL || count == 0U) {
        return;
    }

    if (copy_count >= WAVE_LOW_FREQ_BUF_SIZE) {
        memcpy(g_wave_low_freq_buf,
               &samples[copy_count - WAVE_LOW_FREQ_BUF_SIZE],
               WAVE_LOW_FREQ_BUF_SIZE * sizeof(uint16_t));
        g_wave_low_freq_len = WAVE_LOW_FREQ_BUF_SIZE;
        return;
    }

    if ((uint32_t)g_wave_low_freq_len + copy_count > WAVE_LOW_FREQ_BUF_SIZE) {
        uint16_t overflow = (uint16_t)((uint32_t)g_wave_low_freq_len + copy_count - WAVE_LOW_FREQ_BUF_SIZE);
        memmove(g_wave_low_freq_buf,
                &g_wave_low_freq_buf[overflow],
                (uint32_t)(g_wave_low_freq_len - overflow) * sizeof(uint16_t));
        g_wave_low_freq_len = (uint16_t)(g_wave_low_freq_len - overflow);
    }

    memcpy(&g_wave_low_freq_buf[g_wave_low_freq_len], samples, (uint32_t)copy_count * sizeof(uint16_t));
    g_wave_low_freq_len = (uint16_t)(g_wave_low_freq_len + copy_count);
}

static uint32_t estimate_low_frequency_x10(uint32_t hint_freq_x10)
{
    uint32_t now = HAL_GetTick();
    uint32_t hint_lag;
    uint32_t sample_rate_hz;
    uint16_t lag_min;
    uint16_t lag_max;
    uint16_t best_lag = 0U;
    int64_t best_score_avg = INT64_MIN;
    uint64_t sum = 0U;
    int32_t avg;

    if (hint_freq_x10 == 0U ||
        hint_freq_x10 > (WAVE_LOW_FREQ_LIMIT_HZ * 10U) ||
        hint_freq_x10 < (WAVE_LOW_FREQ_MIN_HZ * 10U) ||
        g_wave_low_freq_len < WAVE_LOW_FREQ_BUF_SIZE) {
        return 0U;
    }

    if (g_ui.state.wave_low_freq_last_ms != 0U &&
        (now - g_ui.state.wave_low_freq_last_ms) < WAVE_LOW_FREQ_ESTIMATE_MS) {
        return 0U;
    }

