lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    g_ui.state.wave_low_freq_last_ms = now;

    sample_rate_hz = WAVE_SAMPLE_RATE_HZ;
    hint_lag = (sample_rate_hz * 10U + (hint_freq_x10 / 2U)) / hint_freq_x10;
    lag_min = (uint16_t)((hint_lag * 65U) / 100U);
    lag_max = (uint16_t)((hint_lag * 150U) / 100U);

    if (lag_min < (sample_rate_hz / WAVE_LOW_FREQ_LIMIT_HZ)) {
        lag_min = (uint16_t)(sample_rate_hz / WAVE_LOW_FREQ_LIMIT_HZ);
    }
    if (lag_max > (sample_rate_hz / WAVE_LOW_FREQ_MIN_HZ)) {
        lag_max = (uint16_t)(sample_rate_hz / WAVE_LOW_FREQ_MIN_HZ);
    }
    if (lag_max >= (WAVE_LOW_FREQ_BUF_SIZE - 8U)) {
        lag_max = WAVE_LOW_FREQ_BUF_SIZE - 8U;
    }
    if (lag_min >= lag_max) {
        return 0U;
    }

    for (uint16_t i = 0; i < WAVE_LOW_FREQ_BUF_SIZE; i++) {
        sum += g_wave_low_freq_buf[i];
    }
    avg = (int32_t)(sum / WAVE_LOW_FREQ_BUF_SIZE);

    for (uint16_t lag = lag_min; lag <= lag_max; lag++) {
        int64_t score = 0;
        int64_t score_avg;
        uint16_t pair_count = (uint16_t)(WAVE_LOW_FREQ_BUF_SIZE - lag);

        for (uint16_t i = 0; i < pair_count; i++) {
            int32_t a = (int32_t)g_wave_low_freq_buf[i] - avg;
            int32_t b = (int32_t)g_wave_low_freq_buf[i + lag] - avg;
            score += (int64_t)a * b;
        }

        score_avg = score / pair_count;
        if (score_avg > best_score_avg) {
            best_score_avg = score_avg;
            best_lag = lag;
        }
    }

    if (best_lag == 0U || best_score_avg <= 0) {
        return 0U;
    }

    return (uint32_t)(((uint64_t)sample_rate_hz * 10ULL + (best_lag / 2U)) / best_lag);
}

static void reset_frequency_display(void)
{
    g_ui.state.wave_freq_valid = false;
    g_ui.state.wave_freq_calc_valid = false;
    g_ui.state.wave_freq_x10 = 0U;
    g_ui.state.wave_freq_calc_x10 = 0U;
    g_ui.state.wave_freq_sum_x10 = 0U;
    g_ui.state.wave_freq_sample_count = 0U;
    g_ui.state.wave_freq_last_ms = 0U;
    g_ui.state.wave_low_freq_last_ms = 0U;
    g_ui.state.wave_period_avg_x100 = 0U;
    g_wave_low_freq_len = 0U;
}

/* newlib-nano has no floating printf enabled. Guard casts even if a future
 * calibration supplies very large (but finite) values outside display range.
 */
static void pm_format_fixed3(char *text, size_t size, float value)
{
    float magnitude = fabsf(value);
    if (!isfinite(value)) { snprintf(text, size, "--"); return; }
    if (magnitude >= 1000000.0f) { snprintf(text, size, "%s>=1e6", value < 0.0f ? "-" : ""); return; }
    uint32_t scaled = (uint32_t)(magnitude * 1000.0f + 0.5f);
    snprintf(text, size, "%s%lu.%03lu", value < 0.0f ? "-" : "",
             (unsigned long)(scaled / 1000U), (unsigned long)(scaled % 1000U));
}

static void update_pm_power(const pm_measurement_t *measurement)
{
    if (g_ui.label_pm_power == NULL || g_ui.label_pm_wavelength == NULL) { return; }
    char text[200];
    snprintf(text, sizeof(text), "Wavelength: %u nm", (unsigned int)measurement->wavelength_nm);
    lv_label_set_text(g_ui.label_pm_wavelength, text);

    const char *status;
    if (!measurement->valid) {
        status = measurement->adc_fault ? "ADC ERROR" :
                 measurement->range_switching ? "SWITCHING / WAIT NEW DATA" : "WAIT ADC";
    } else if (measurement->over_range) { status = "OVER RANGE";
    } else if (measurement->adc_mean >= (float)ADC_FULL_SCALE) { status = "ADC SATURATED";
    } else if (measurement->responsivity_A_W <= 0.0f) { status = "NO RESP DATA";
    } else if (!measurement->power_valid) { status = "NUMERIC ERROR";
    } else { status = measurement->out_of_spec ? "OUT OF SPEC" : "IN SPEC (NOMINAL)"; }

    char current[24];
    if (measurement->valid) { pm_format_fixed3(current, sizeof(current), measurement->photocurrent_A * 1000000.0f); }
    else { snprintf(current, sizeof(current), "--"); }
    if (measurement->power_valid) {
        char power[24], dbm[24];
        pm_format_fixed3(power, sizeof(power), measurement->power_mW);
        if (measurement->dbm_valid) { pm_format_fixed3(dbm, sizeof(dbm), measurement->power_dBm); }
        else { snprintf(dbm, sizeof(dbm), "-- (zero)"); }
        snprintf(text, sizeof(text), "Power: %s mW | %s dBm | %s\nIphoto: %s uA | Typical LUT, uncalibrated",
                 power, dbm, status, current);
    } else {
        snprintf(text, sizeof(text), "Power: -- mW | -- dBm | %s\nIphoto: %s uA | Typical LUT, uncalibrated",
                 status, current);
    }
    lv_label_set_text(g_ui.label_pm_power, text);
    lv_obj_set_style_text_color(g_ui.label_pm_power,
                               measurement->power_valid && !measurement->out_of_spec ? C_ACCENT : C_WARN, 0);
}

static void update_pm_debug(lv_timer_t *timer)
{
    (void)timer;
    if (g_ui.label_pm_debug == NULL) {
        return;
    }

    const pm_measurement_t *measurement = PM_GetMeasurement();
    update_pm_power(measurement);
    const char *mode = measurement->mode == PM_MODE_AUTO ? "AUTO" : "MANUAL";
    const char *range = "LOW";
    if (measurement->current_range == PM_RANGE_HIGH) { range = "HIGH"; }
    else if (measurement->current_range == PM_RANGE_MID) { range = "MID"; }
    char text[240];
    if (!measurement->valid) {
        const char *status = measurement->adc_fault ? "ADC ERROR" :
                             measurement->range_switching ? "SWITCHING / WAIT NEW DATA" : "WAIT ADC";
        snprintf(text, sizeof(text), "PM | %s | %s | %s\nADC RAW: --\nADC Voltage: --\nFiltered Voltage: --",
                 mode, range, status);
        lv_obj_set_style_text_color(g_ui.label_pm_debug, measurement->adc_fault ? C_BAD : C_WARN, 0);
        lv_label_set_text(g_ui.label_pm_debug, text);
        return;
    }

    /* Format with integer fields; the project uses newlib-nano without %f. */
    uint32_t voltage_mV = (uint32_t)(measurement->adc_voltage_V * 1000.0f + 0.5f);
    uint32_t filtered_mV = (uint32_t)(measurement->filtered_voltage_V * 1000.0f + 0.5f);
    uint32_t mean_x100 = (uint32_t)(measurement->adc_mean * 100.0f + 0.5f);
    snprintf(text, sizeof(text),
             "PM | %s | %s | %s\n"
             "ADC RAW: %u  Mean: %lu.%02lu  Min: %u  Max: %u\n"
             "ADC Voltage: %lu.%03lu V\n"
             "Filtered Voltage: %lu.%03lu V",
             mode, range, measurement->over_range ? "OVER RANGE" : "NORMAL",
             (unsigned int)measurement->adc_raw,
             (unsigned long)(mean_x100 / 100U), (unsigned long)(mean_x100 % 100U),
             (unsigned int)measurement->adc_min, (unsigned int)measurement->adc_max,
             (unsigned long)(voltage_mV / 1000U), (unsigned long)(voltage_mV % 1000U),
             (unsigned long)(filtered_mV / 1000U), (unsigned long)(filtered_mV % 1000U));
    lv_obj_set_style_text_color(g_ui.label_pm_debug, measurement->over_range ? C_BAD : C_ACCENT, 0);
    lv_label_set_text(g_ui.label_pm_debug, text);
}

static const char *pm_range_name(pm_range_t range)
{
    if (range == PM_RANGE_HIGH) { return "高"; }
    if (range == PM_RANGE_MID) { return "中"; }
    return "低";
}

static const char *pm_status_name(const pm_measurement_t *measurement)
{
    if (!measurement->valid) {
        return measurement->range_switching ? "切换中" :
               measurement->adc_fault ? "ADC错误" : "等待ADC";
    }
    if (measurement->over_range || measurement->adc_mean >= (float)ADC_FULL_SCALE) { return "过载"; }
    if (!measurement->power_valid) {
        return measurement->responsivity_A_W <= 0.0f ? "无响应数据" : "测量错误";
    }
    if (measurement->under_range) { return "过低"; }
    if (measurement->out_of_spec) { return "超出规格"; }
    return "正常";
}

static lv_color_t pm_status_color(const pm_measurement_t *measurement)
{
    if (measurement->valid && measurement->power_valid && !measurement->under_range &&
        !measurement->out_of_spec && !measurement->over_range) { return C_OK; }
    if (measurement->range_switching || measurement->under_range ||
        (measurement->valid && measurement->responsivity_A_W <= 0.0f)) { return C_WARN; }
    return C_BAD;
}

static void update_power_meter_ui(lv_timer_t *timer)
{
    (void)timer;
    if (g_ui.label_pm_main == NULL) { return; }

