lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    const pm_measurement_t *measurement = PM_GetMeasurement();
    char text[96];
    char value[32];
    lv_color_t color = pm_status_color(measurement);
    if (!measurement->valid || !measurement->power_valid) {
        snprintf(text, sizeof(text), "--");
    } else if (g_ui.pm_show_dbm) {
        if (measurement->dbm_valid) {
            pm_format_fixed3(value, sizeof(value), measurement->power_dBm);
            snprintf(text, sizeof(text), "%sdBm", value);
        } else {
            snprintf(text, sizeof(text), "--dBm");
        }
    } else if (g_ui.pm_show_uW) {
        pm_format_fixed3(value, sizeof(value), measurement->power_uW);
        snprintf(text, sizeof(text), "%suW", value);
    } else {
        pm_format_fixed3(value, sizeof(value), measurement->power_mW);
        snprintf(text, sizeof(text), "%smW", value);
    }
    lv_label_set_text(g_ui.label_pm_main, text);
    lv_obj_set_style_text_color(g_ui.label_pm_main, color, 0);

    snprintf(text, sizeof(text), "波长:%unm", (unsigned int)measurement->wavelength_nm);
    lv_label_set_text(g_ui.label_pm_wavelength, text);
    snprintf(text, sizeof(text), "档位:%s%s",
             measurement->mode == PM_MODE_AUTO ? "自动" : "手动",
             pm_range_name(measurement->current_range));
    lv_label_set_text(g_ui.label_pm_range, text);
    pm_format_fixed3(value, sizeof(value), measurement->filtered_voltage_V);
    snprintf(text, sizeof(text), "前端:%sV", measurement->valid ? value : "--");
    lv_label_set_text(g_ui.label_pm_afe, text);
    snprintf(text, sizeof(text), "状态:%s", pm_status_name(measurement));
    lv_label_set_text(g_ui.label_pm_status, text);
    lv_obj_set_style_text_color(g_ui.label_pm_status, color, 0);
    pm_format_fixed3(value, sizeof(value), measurement->responsivity_A_W);
    char correction[24];
    pm_format_fixed3(correction, sizeof(correction), measurement->wavelength_correction);
    pm_wavelength_cal_point_t active_points[PM_WAVELENGTH_CAL_MAX_POINTS];
    uint8_t active_count=PM_GetWavelengthCalibrationPoints(active_points,PM_WAVELENGTH_CAL_MAX_POINTS);
    snprintf(text, sizeof(text), "响应:%sA/W校正:%s%s", value, correction,
             measurement->wavelength_calibrated ? "实测" : (active_count ? "插值" : "默认"));
    if(PM_GetZeroState()==PM_ZERO_IDLE) lv_label_set_text(g_ui.label_pm_hint,text);

    set_button_selected(g_ui.btn_pm_linear, !g_ui.pm_show_dbm);
    set_button_selected(g_ui.btn_pm_unit, !g_ui.pm_show_dbm && g_ui.pm_show_uW);
    set_button_selected(g_ui.btn_pm_auto, measurement->mode == PM_MODE_AUTO);
    for (uint32_t i = 0U; i < 3U; i++) {
        set_button_selected(g_ui.btn_pm_range[i], measurement->mode == PM_MODE_MANUAL &&
                            measurement->current_range == (pm_range_t)i);
    }
    pm_zero_ui_service();
    pm_cal_update_dialog();
}

static void pm_display_mode_event(lv_event_t *event)
{
    (void)event;
    g_ui.pm_show_dbm = !g_ui.pm_show_dbm;
    update_power_meter_ui(NULL);
}

static void pm_linear_unit_event(lv_event_t *event)
{
    (void)event;
    if (!g_ui.pm_show_dbm) { g_ui.pm_show_uW = !g_ui.pm_show_uW; }
    update_power_meter_ui(NULL);
}

static void pm_auto_range_event(lv_event_t *event)
{
    (void)event;
    const pm_measurement_t *measurement = PM_GetMeasurement();
    (void)PM_SetMode(measurement->mode == PM_MODE_AUTO ? PM_MODE_MANUAL : PM_MODE_AUTO);
    update_power_meter_ui(NULL);
}

#if 0 /* Legacy placeholder retained with the removed legacy SCOPE page. */
static void pm_reserved_event(lv_event_t *event)
{
    const char *name = (const char *)lv_event_get_user_data(event);
    if (g_ui.label_pm_hint != NULL) {
        lv_label_set_text(g_ui.label_pm_hint, name != NULL && name[0] == 'Z' ?
                          "清零功能待实现" :
                          "校准功能待实现");
    }
}

#endif

static void pm_power_wavelength_event(lv_event_t *event)
{
    static const int32_t steps[] = {-10, -1, 1, 10};
    uintptr_t index = (uintptr_t)lv_event_get_user_data(event);
    if (index < sizeof(steps) / sizeof(steps[0])) {
        (void)PM_SetWavelength((int32_t)PM_GetMeasurement()->wavelength_nm + steps[index]);
    }
    update_power_meter_ui(NULL);
}

static pm_display_mode_t pm_current_display_mode(void)
{
    if (g_ui.pm_show_dbm) { return PM_DISPLAY_MODE_DBM; }
    return g_ui.pm_show_uW ? PM_DISPLAY_MODE_UW : PM_DISPLAY_MODE_MW;
}

static void pm_set_display_mode(pm_display_mode_t mode)
{
    g_ui.pm_show_dbm = mode == PM_DISPLAY_MODE_DBM;
    g_ui.pm_show_uW = mode == PM_DISPLAY_MODE_UW;
}

static const char *pm_zero_state_name(pm_zero_state_t state)
{
    if (state == PM_ZERO_LOW) { return "清零低"; }
    if (state == PM_ZERO_MID) { return "清零中"; }
    if (state == PM_ZERO_HIGH) { return "清零高"; }
    if (state == PM_ZERO_RESTORING) { return "清零恢复中"; }
    return state == PM_ZERO_FAILED ? "清零失败" : "清零完成";
}

static void pm_zero_ui_service(void)
{
    pm_zero_state_t state = PM_GetZeroState();
    if (g_ui.label_pm_hint == NULL || state == PM_ZERO_IDLE) { return; }
    if (state == PM_ZERO_DONE && !g_ui.zero_save_handled)
    {
        g_ui.zero_save_handled = true;
        if (!PM_Storage_Save(pm_current_display_mode()))
        {
            (void)PM_SetPowerParameters(&g_ui.zero_backup);
            g_ui.zero_save_failed = true;
        }
    }
    lv_label_set_text(g_ui.label_pm_hint,
                      g_ui.zero_save_failed ? "清零失败" : pm_zero_state_name(state));
}

static void pm_zero_start(void)
{
    g_ui.zero_backup = *PM_GetPowerParameters();
    g_ui.zero_save_handled = false;
    g_ui.zero_save_failed = false;
    if (!PM_StartZero() && g_ui.label_pm_hint != NULL)
    {
        lv_label_set_text(g_ui.label_pm_hint, "清零失败");
    }
    pm_zero_ui_service();
    update_power_meter_ui(NULL);
}

static void pm_zero_confirm_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.zero_confirm_overlay != NULL)
    {
        lv_obj_add_flag(g_ui.zero_confirm_overlay, LV_OBJ_FLAG_HIDDEN);
    }
    pm_zero_start();
}

static void pm_zero_cancel_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.zero_confirm_overlay != NULL)
    {
        lv_obj_add_flag(g_ui.zero_confirm_overlay, LV_OBJ_FLAG_HIDDEN);
    }
}

