lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
static void pm_zero_event(lv_event_t *event)
{
    (void)event;
    pm_zero_state_t state = PM_GetZeroState();
    if (state == PM_ZERO_LOW || state == PM_ZERO_MID || state == PM_ZERO_HIGH ||
        state == PM_ZERO_RESTORING)
    {
        pm_zero_ui_service();
        return;
    }
    if (g_ui.zero_confirm_overlay != NULL)
    {
        lv_obj_clear_flag(g_ui.zero_confirm_overlay, LV_OBJ_FLAG_HIDDEN);
    }
}

static bool pm_parse_reference_mW(const char *input, float *reference_mW)
{
    uint32_t integer = 0U;
    uint32_t fraction = 0U;
    uint32_t divisor = 1U;
    bool decimal = false;
    bool digit = false;
    if (input == NULL || reference_mW == NULL) { return false; }
    for (size_t i = 0U; input[i] != '\0'; i++)
    {
        char c = input[i];
        if (c == '.')
        {
            if (decimal) { return false; }
            decimal = true;
            continue;
        }
        if (c < '0' || c > '9') { return false; }
        digit = true;
        uint32_t value = (uint32_t)(c - '0');
        if (!decimal)
        {
            if (integer > 100000U) { return false; }
            integer = integer * 10U + value;
        }
        else if (divisor < 1000U)
        {
            fraction = fraction * 10U + value;
            divisor *= 10U;
        }
        else { return false; }
    }
    float parsed = (float)integer + (float)fraction / (float)divisor;
    if (!digit || !isfinite(parsed) || parsed <= 0.0f) { return false; }
    *reference_mW = parsed;
    return true;
}

static void pm_cal_update_dialog(void)
{
    if (g_ui.cal_overlay == NULL) { return; }
    const pm_measurement_t *measurement = PM_GetMeasurement();
    const pm_power_parameters_t *parameters = PM_GetPowerParameters();
    char text[48];
    snprintf(text, sizeof(text), "参考功率:%smW", g_ui.cal_input[0] ? g_ui.cal_input : "0");
    lv_label_set_text(g_ui.label_cal_input, text);
    snprintf(text, sizeof(text), "波长:%unm", (unsigned int)measurement->wavelength_nm);
    lv_label_set_text(g_ui.label_cal_wave, text);

    char value[24];
    pm_format_fixed3(value, sizeof(value), measurement->filtered_voltage_V);
    snprintf(text, sizeof(text), "当前AFE:%sV", measurement->valid ? value : "--");
    lv_label_set_text(g_ui.label_cal_afe, text);
    pm_format_fixed3(value, sizeof(value), measurement->raw_power_mW);
    snprintf(text, sizeof(text), "功率(未校正):%smW", measurement->raw_power_valid ? value : "--");
    lv_label_set_text(g_ui.label_cal_raw_power, text);
    snprintf(text, sizeof(text), "当前档位:%s", pm_range_name(measurement->current_range));
    lv_label_set_text(g_ui.label_cal_current_range, text);
    pm_format_fixed3(value, sizeof(value), parameters->gain_correction[g_ui.cal_range]);
    snprintf(text, sizeof(text), "当前校正:%s", value);
    lv_label_set_text(g_ui.label_cal_gain, text);
    pm_wavelength_cal_point_t points[PM_WAVELENGTH_CAL_MAX_POINTS];
    uint8_t count=PM_GetWavelengthCalibrationPoints(points,PM_WAVELENGTH_CAL_MAX_POINTS);
    size_t used=(size_t)snprintf(text,sizeof(text),"点:");
    for(uint8_t i=0U;i<count&&used<sizeof(text);i++){char factor[16];pm_format_fixed3(factor,sizeof(factor),points[i].correction_factor);used+=(size_t)snprintf(&text[used],sizeof(text)-used,"%u:%s",(unsigned)points[i].wavelength_nm,factor);}
    if(count==0U) snprintf(text,sizeof(text),"点:0");
    lv_label_set_text(g_ui.label_cal_points,text);
    for (uint32_t i = 0U; i < 3U; i++) {
        set_button_selected(g_ui.btn_cal_range[i], g_ui.cal_range == (pm_range_t)i);
    }
}

static const char *pm_calibration_check_name(pm_calibration_check_t check)
{
    switch (check)
    {
        case PM_CAL_CHECK_OK: return "校准";
        case PM_CAL_CHECK_REFERENCE_INVALID: return "参考功率错误";
        case PM_CAL_CHECK_ADC_INVALID: return "ADC错误";
        case PM_CAL_CHECK_RANGE_SWITCHING: return "等待档位稳定";
        case PM_CAL_CHECK_RANGE_MISMATCH: return "切换校准档";
        case PM_CAL_CHECK_OVER_RANGE: return "过载";
        case PM_CAL_CHECK_RESPONSIVITY_INVALID: return "无响应数据";
        case PM_CAL_CHECK_SIGNAL_TOO_LOW: return "数据过低";
        case PM_CAL_CHECK_RAW_POWER_INVALID: return "功率错误";
        default: return "校准失败";
    }
}

static void pm_cal_range_event(lv_event_t *event)
{
    g_ui.cal_range = (pm_range_t)(uintptr_t)lv_event_get_user_data(event);
    (void)PM_SetManualRange(g_ui.cal_range);
    pm_cal_update_dialog();
    update_power_meter_ui(NULL);
}

static void pm_cal_wavelength_event(lv_event_t *event)
{
    static const int32_t steps[] = {-10, -1, 1, 10};
    uintptr_t index = (uintptr_t)lv_event_get_user_data(event);
    if (index < sizeof(steps) / sizeof(steps[0]))
    {
        (void)PM_SetWavelength((int32_t)PM_GetMeasurement()->wavelength_nm + steps[index]);
    }
    pm_cal_update_dialog();
    update_power_meter_ui(NULL);
}

static void pm_cal_key_event(lv_event_t *event)
{
    const char *key = (const char *)lv_event_get_user_data(event);
    size_t length = strlen(g_ui.cal_input);
    if (key == NULL) { return; }
    if (strcmp(key, "DEL") == 0)
    {
        if (length > 0U) { g_ui.cal_input[length - 1U] = '\0'; }
    }
    else if (strcmp(key, "DOT") == 0)
    {
        if (length == 0U) { snprintf(g_ui.cal_input, sizeof(g_ui.cal_input), "0."); }
        else if (strchr(g_ui.cal_input, '.') == NULL && length + 1U < sizeof(g_ui.cal_input))
        {
            g_ui.cal_input[length] = '.';
            g_ui.cal_input[length + 1U] = '\0';
        }
    }
    else if (key[0] >= '0' && key[0] <= '9' && key[1] == '\0' && length + 1U < sizeof(g_ui.cal_input))
    {
        g_ui.cal_input[length] = key[0];
        g_ui.cal_input[length + 1U] = '\0';
    }
    pm_cal_update_dialog();
}

static void pm_cal_cancel_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.cal_overlay != NULL) { lv_obj_add_flag(g_ui.cal_overlay, LV_OBJ_FLAG_HIDDEN); }
}

static void pm_cal_confirm_event(lv_event_t *event)
{
    (void)event;
    float reference_mW;
    if (!pm_parse_reference_mW(g_ui.cal_input, &reference_mW))
    {
        lv_label_set_text(g_ui.label_cal_status, "参考功率错误");
        return;
    }
    pm_calibration_check_t check = PM_CheckCalibration(g_ui.cal_range, reference_mW);
    if (check != PM_CAL_CHECK_OK)
    {
        lv_label_set_text(g_ui.label_cal_status, pm_calibration_check_name(check));
        return;
    }
    g_ui.cal_backup = *PM_GetPowerParameters();
    if (!PM_CalibrateRange(g_ui.cal_range, reference_mW))
    {
        lv_label_set_text(g_ui.label_cal_status, "校准失败");
        return;
    }
    if (!PM_Storage_Save(pm_current_display_mode()))
    {
        (void)PM_SetPowerParameters(&g_ui.cal_backup);
        lv_label_set_text(g_ui.label_cal_status, "校准失败");
        return;
    }
    if (g_ui.label_pm_hint != NULL) { lv_label_set_text(g_ui.label_pm_hint, "校准完成"); }
    lv_obj_add_flag(g_ui.cal_overlay, LV_OBJ_FLAG_HIDDEN);
    update_power_meter_ui(NULL);
}

static void pm_wavelength_cal_event(lv_event_t *event)
{
    (void)event; float reference_mW;
    if(!pm_parse_reference_mW(g_ui.cal_input,&reference_mW)){lv_label_set_text(g_ui.label_cal_status,"参考功率错误");return;}
    pm_calibration_check_t check=PM_CheckCalibration(PM_GetMeasurement()->current_range,reference_mW);
    if(check!=PM_CAL_CHECK_OK){lv_label_set_text(g_ui.label_cal_status,pm_calibration_check_name(check));return;}
    if(!PM_CalibrateWavelength(reference_mW)||!PM_Storage_Save(pm_current_display_mode())){lv_label_set_text(g_ui.label_cal_status,"校准失败");return;}
    lv_label_set_text(g_ui.label_cal_status,"波长校准完成");
}
static void pm_wavelength_delete_event(lv_event_t *event)
{(void)event; if(PM_DeleteWavelengthCalibrationPoint(PM_GetMeasurement()->wavelength_nm)&&PM_Storage_Save(pm_current_display_mode()))lv_label_set_text(g_ui.label_cal_status,"删除完成");else lv_label_set_text(g_ui.label_cal_status,"删除失败");}
static void pm_wavelength_reset_event(lv_event_t *event)
{(void)event; PM_ResetWavelengthCalibration(); if(PM_Storage_Save(pm_current_display_mode()))lv_label_set_text(g_ui.label_cal_status,"恢复完成");else lv_label_set_text(g_ui.label_cal_status,"恢复失败");}

static void pm_cal_open_event(lv_event_t *event)
{
    (void)event;
    if (PM_GetZeroState() == PM_ZERO_LOW || PM_GetZeroState() == PM_ZERO_MID ||
        PM_GetZeroState() == PM_ZERO_HIGH || PM_GetZeroState() == PM_ZERO_RESTORING)
    {
        if (g_ui.label_pm_hint != NULL) { lv_label_set_text(g_ui.label_pm_hint, "清零中"); }
        return;
    }
    g_ui.cal_range = PM_GetMeasurement()->current_range;
    g_ui.cal_input[0] = '\0';
    lv_label_set_text(g_ui.label_cal_status, "");
    lv_obj_clear_flag(g_ui.cal_overlay, LV_OBJ_FLAG_HIDDEN);
    pm_cal_update_dialog();
}

static void pm_save_settings_event(lv_event_t *event)
{
    (void)event;
    if (g_ui.label_pm_hint != NULL)
    {
        lv_label_set_text(g_ui.label_pm_hint,
                          PM_Storage_Save(pm_current_display_mode()) ? "保存完成" : "保存失败");
    }
}

