lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
static void render_zero_confirm_dialog(lv_obj_t *parent, int32_t width, int32_t height)
{
    g_ui.zero_confirm_overlay = make_obj(parent, 0, 0, width, height, C_BG);
    lv_obj_t *dialog = make_panel(g_ui.zero_confirm_overlay, (width - 380) / 2, 128, 380, 190, "清零");
    make_label(dialog, "无光S1223-01", 26, 56, &lv_font_chinese_14, C_TEXT);
    make_label(dialog, "确认", 26, 88, &lv_font_chinese_14, C_MUTED);
    make_button(dialog, "取消", 26, 132, 130, 34, C_PANEL_2, pm_zero_cancel_event);
    make_button(dialog, "确认", 204, 132, 130, 34, C_ACCENT, pm_zero_confirm_event);
    lv_obj_add_flag(g_ui.zero_confirm_overlay, LV_OBJ_FLAG_HIDDEN);
}

static void render_calibration_dialog(lv_obj_t *parent, int32_t width, int32_t height)
{
    g_ui.cal_overlay = make_obj(parent, 0, 0, width, height, C_BG);
    lv_obj_t *dialog = make_panel(g_ui.cal_overlay, 10, 54, width - 20, height - 64, "校准");
    g_ui.label_cal_afe = make_label(dialog, "当前AFE:--V", 14, 42, &lv_font_chinese_14, C_TEXT);
    g_ui.label_cal_raw_power = make_label(dialog, "功率(未校正):--mW", 14, 68, &lv_font_chinese_14, C_TEXT);
    g_ui.label_cal_current_range = make_label(dialog, "当前档位:--", 14, 94, &lv_font_chinese_14, C_TEXT);
    g_ui.label_cal_gain = make_label(dialog, "当前校正:--", 14, 120, &lv_font_chinese_14, C_TEXT);

    make_label(dialog, "校准档位", 300, 42, &lv_font_chinese_14, C_TEXT);
    static const char *range_names[] = {"高", "中", "低"};
    for (uint32_t i = 0U; i < 3U; i++) {
        g_ui.btn_cal_range[i] = make_button(dialog, range_names[i], 398 + (int32_t)i * 62, 34,
                                             54, 30, C_PANEL_2, NULL);
        lv_obj_add_event_cb(g_ui.btn_cal_range[i], pm_cal_range_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }
    g_ui.label_cal_wave = make_label(dialog, "波长:--", 300, 78, &lv_font_chinese_14, C_MUTED);
    static const char *wave_steps[] = {"-10", "-1", "+1", "+10"};
    for (uint32_t i = 0U; i < 4U; i++) {
        lv_obj_t *button = make_button(dialog, wave_steps[i], 398 + (int32_t)i * 62, 70,
                                       54, 30, C_PANEL_2, NULL);
        lv_obj_add_event_cb(button, pm_cal_wavelength_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }
    g_ui.label_cal_input = make_label(dialog, "参考功率:0mW", 300, 112, &lv_font_chinese_14, C_TEXT);
    g_ui.label_cal_status = make_label(dialog, "", 300, 138, &lv_font_chinese_14, C_WARN);
    lv_obj_set_width(g_ui.label_cal_status, width - 330);

    static const char *keys[] = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "DOT", "0", "DEL"};
    static const char *key_text[] = {"1", "2", "3", "4", "5", "6", "7", "8", "9", ".", "0", "删除"};
    for (uint32_t i = 0U; i < 12U; i++) {
        int32_t x = 14 + (int32_t)(i % 3U) * 70;
        int32_t y = 158 + (int32_t)(i / 3U) * 42;
        lv_obj_t *button = make_button(dialog, key_text[i], x, y, 60, 34, C_PANEL_2, NULL);
        lv_obj_add_event_cb(button, pm_cal_key_event, LV_EVENT_CLICKED, (void *)keys[i]);
    }
    make_button(dialog, "取消", 300, 180, 120, 34, C_PANEL_2, pm_cal_cancel_event);
    make_button(dialog, "校准", 438, 180, 120, 34, C_ACCENT, pm_cal_confirm_event);
    make_button(dialog, "波长校准", 300, 230, 120, 34, C_PANEL_2, pm_wavelength_cal_event);
    make_button(dialog, "删除", 438, 230, 58, 34, C_PANEL_2, pm_wavelength_delete_event);
    make_button(dialog, "恢复", 510, 230, 58, 34, C_PANEL_2, pm_wavelength_reset_event);
    g_ui.label_cal_points=make_label(dialog,"点:0",300,280,&lv_font_chinese_14,C_MUTED);
    lv_obj_add_flag(g_ui.cal_overlay, LV_OBJ_FLAG_HIDDEN);
}

static void render_power_meter(void)
{
    lv_obj_t *c = g_ui.content;
    int32_t width = lv_obj_get_width(c);
    int32_t height = lv_obj_get_height(c);
    if (width <= 0) { width = 800; }
    if (height <= 0) { height = 480; }
    int32_t pad = 10;
    int32_t right_w = 260;
    int32_t main_w = width - right_w - pad * 3;
    if (main_w < 360) { main_w = 360; right_w = width - main_w - pad * 3; }

    lv_obj_t *header = make_obj(c, 0, 0, width, 44, C_BG);
    make_label(header, "光功率计", 14, 13, &lv_font_chinese_14, C_TEXT);
    make_label(header, "STM32H743|S1223-01", width - 190, 14, &lv_font_chinese_14, C_MUTED);
    make_obj(c, 0, 43, width, 1, C_LINE);

    lv_obj_t *reading = make_panel(c, pad, 54, main_w, 130, "已测光功率");
    g_ui.label_pm_main = make_label(reading, "--", 16, 50, &lv_font_montserrat_32, C_WARN);
    lv_obj_set_width(g_ui.label_pm_main, main_w - 32);
    lv_label_set_long_mode(g_ui.label_pm_main, LV_LABEL_LONG_CLIP);

    lv_obj_t *info = make_panel(c, pad * 2 + main_w, 54, right_w, 130, "实时状态");
    g_ui.label_pm_wavelength = make_label(info, "波长:--", 14, 42, &lv_font_chinese_14, C_TEXT);
    g_ui.label_pm_range = make_label(info, "档位:--", 14, 64, &lv_font_chinese_14, C_TEXT);
    g_ui.label_pm_afe = make_label(info, "前端:--V", 14, 86, &lv_font_chinese_14, C_TEXT);
    g_ui.label_pm_status = make_label(info, "状态:等待ADC", 14, 108, &lv_font_chinese_14, C_WARN);

    lv_obj_t *display = make_panel(c, pad, 194, main_w, 62, "显示");
    g_ui.btn_pm_linear = make_button(display, "线性/dBm", 14, 27, 144, 30, C_PANEL_2, pm_display_mode_event);
    g_ui.btn_pm_unit = make_button(display, "mW/uW", 170, 27, 108, 30, C_PANEL_2, pm_linear_unit_event);
    make_label(display, "线性支持mW和uW", 290, 35, &lv_font_chinese_14, C_MUTED);

    lv_obj_t *range = make_panel(c, pad * 2 + main_w, 194, right_w, 62, "量程控制");
    g_ui.btn_pm_auto = make_button(range, "自动量程", 12, 27, 112, 30, C_PANEL_2, pm_auto_range_event);
    static const char *range_names[] = {"高", "中", "低"};
    for (uint32_t i = 0U; i < 3U; i++) {
        g_ui.btn_pm_range[i] = make_button(range, range_names[i], 132 + (int32_t)i * 40, 27,
                                            36, 30, C_PANEL_2, NULL);
        lv_obj_add_event_cb(g_ui.btn_pm_range[i], pm_manual_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }

    lv_obj_t *wave = make_panel(c, pad, 266, width - pad * 2, 62, "波长设置(400-1000nm)");
    static const char *wave_steps[] = {"-10", "-1", "+1", "+10"};
    for (uint32_t i = 0U; i < 4U; i++) {
        lv_obj_t *button = make_button(wave, wave_steps[i], 14 + (int32_t)i * 64, 27, 56, 30, C_PANEL_2, NULL);
        lv_obj_add_event_cb(button, pm_power_wavelength_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }
    g_ui.label_pm_hint = make_label(wave, "响应表:660-960nm", 292, 35,
                                    &lv_font_chinese_14, C_MUTED);

    lv_obj_t *actions = make_panel(c, pad, 338, width - pad * 2, 58, "校准");
    lv_obj_t *zero = make_button(actions, "清零", 14, 25, 100, 30, C_PANEL_2, NULL);
    lv_obj_add_event_cb(zero, pm_zero_event, LV_EVENT_CLICKED, NULL);
    lv_obj_t *cal = make_button(actions, "校准", 126, 25, 100, 30, C_PANEL_2, NULL);
    lv_obj_add_event_cb(cal, pm_cal_open_event, LV_EVENT_CLICKED, NULL);
    make_label(actions, "当前阶段不修改零点或校准值",
               242, 33, &lv_font_chinese_14, C_MUTED);

