lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    lv_obj_t *save_area = make_obj(actions, 238, 25, width - 262, 30, C_PANEL);
    make_button(save_area, "保存设置", 0, 0, 100, 30, C_PANEL_2, pm_save_settings_event);
    make_label(save_area, "清零和校准完成后自动保存", 112, 8, &lv_font_chinese_14, C_MUTED);
    render_zero_confirm_dialog(c, width, height);
    render_calibration_dialog(c, width, height);
    update_power_meter_ui(NULL);
}

static void pm_auto_event(lv_event_t *event)
{
    (void)event;
    (void)PM_SetMode(PM_MODE_AUTO);
    update_pm_debug(NULL);
}

static void pm_manual_event(lv_event_t *event)
{
    pm_range_t range = (pm_range_t)(uintptr_t)lv_event_get_user_data(event);
    (void)PM_SetManualRange(range);
    update_pm_debug(NULL);
    update_power_meter_ui(NULL);
}

static void pm_wavelength_event(lv_event_t *event)
{
    static const int32_t steps[] = {-10, -1, 1, 10};
    uintptr_t index = (uintptr_t)lv_event_get_user_data(event);
    if (index >= sizeof(steps) / sizeof(steps[0])) { return; }
    (void)PM_SetWavelength((int32_t)PM_GetMeasurement()->wavelength_nm + steps[index]);
    update_pm_debug(NULL);
    update_power_meter_ui(NULL);
}

static void render_scope(void)
{
    lv_obj_t *c = g_ui.content;

    lv_obj_t *scope = make_panel(c, 8, 8, 784, 336, "ADC Waveform - PA5 / ADC1 CH19");
    make_label(scope, "ADC and AFSK receiver are running. Wave drawing is paused to reduce LVGL load.", 14, 42,
               &lv_font_montserrat_14, C_WARN);

#if WAVE_DRAW_ENABLE
    lv_obj_t *plot = make_panel(scope, 14, 70, 756, 210, NULL);
    lv_obj_set_style_bg_color(plot, lv_color_hex(0x101820), 0);

    for (int32_t i = 1; i < 4; i++) {
        make_obj(plot, (756 * i) / 4, 0, 1, 210, C_LINE);
    }
    for (int32_t i = 1; i < 4; i++) {
        make_obj(plot, 0, (210 * i) / 4, 756, 1, C_LINE);
    }
    make_obj(plot, 0, 105, 756, 1, lv_color_hex(0x546575));

    g_ui.wave_line = lv_line_create(plot);
    lv_obj_set_style_line_color(g_ui.wave_line, C_ACCENT, 0);
    lv_obj_set_style_line_width(g_ui.wave_line, 2, 0);
    lv_obj_set_style_line_rounded(g_ui.wave_line, false, 0);
    lv_obj_set_pos(g_ui.wave_line, 0, 0);

    g_ui.label_wave_info = make_label(scope, "", 14, 292, &lv_font_montserrat_14, C_TEXT);
#else
    g_ui.wave_line = NULL;
    g_ui.label_pm_power = make_label(scope, "", 14, 76, &lv_font_montserrat_14, C_ACCENT);
    lv_obj_set_width(g_ui.label_pm_power, 740);
    lv_label_set_long_mode(g_ui.label_pm_power, LV_LABEL_LONG_CLIP);
    g_ui.label_wave_info = make_label(scope, "", 14, 126, &lv_font_montserrat_14, C_TEXT);
    g_ui.label_pm_wavelength = make_label(scope, "", 14, 155, &lv_font_montserrat_14, C_TEXT);
    static const char *wavelength_steps[] = {"-10", "-1", "+1", "+10"};
    for (uint32_t i = 0U; i < 4U; i++) {
        lv_obj_t *button = make_button(scope, wavelength_steps[i], 194 + (int32_t)i * 66, 150,
                                       60, 28, C_PANEL_2, NULL);
        lv_obj_add_event_cb(button, pm_wavelength_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }
    make_label(scope, "LUT: 660-960 nm (typ.)", 476, 155, &lv_font_montserrat_14, C_MUTED);
    g_ui.label_pm_debug = make_label(scope, "", 14, 184, &lv_font_montserrat_14, C_ACCENT);
    lv_obj_set_width(g_ui.label_pm_debug, 740);
    lv_label_set_long_mode(g_ui.label_pm_debug, LV_LABEL_LONG_WRAP);
    update_pm_debug(NULL);
    make_button(scope, "AUTO", 14, 274, 100, 32, C_PANEL_2, pm_auto_event);
    static const char *range_names[] = {"HIGH", "MID", "LOW"};
    for (uint32_t i = 0U; i < 3U; i++) {
        lv_obj_t *button = make_button(scope, range_names[i], 126 + (int32_t)i * 112, 274,
                                       100, 32, C_PANEL_2, NULL);
        lv_obj_add_event_cb(button, pm_manual_event, LV_EVENT_CLICKED, (void *)(uintptr_t)i);
    }
#endif
    lv_obj_set_width(g_ui.label_wave_info, 740);
    lv_label_set_long_mode(g_ui.label_wave_info, LV_LABEL_LONG_CLIP);

    make_label(scope, "AFSK: 1200/2200Hz, 100bps, 16-phase bit-window search.", 14, 314,
               &lv_font_montserrat_14, C_MUTED);
    update_waveform_obj();
}

static void render_page(slave_page_t page)
{
    if (page >= PAGE_COUNT) {
        return;
    }

    g_ui.page = page;
    g_ui.label_station_value = NULL;
    g_ui.label_group_value = NULL;
    g_ui.label_wave_info = NULL;
    g_ui.label_pm_debug = NULL;
    g_ui.label_pm_power = NULL;
    g_ui.label_pm_wavelength = NULL;
    g_ui.label_pm_main = NULL;
    g_ui.label_pm_range = NULL;
    g_ui.label_pm_afe = NULL;
    g_ui.label_pm_status = NULL;
    g_ui.label_pm_hint = NULL;
    g_ui.btn_pm_linear = NULL;
    g_ui.btn_pm_unit = NULL;
    g_ui.btn_pm_auto = NULL;
    memset(g_ui.btn_pm_range, 0, sizeof(g_ui.btn_pm_range));
    g_ui.zero_confirm_overlay = NULL;
    g_ui.cal_overlay = NULL;
    g_ui.label_cal_input = NULL;
    g_ui.label_cal_wave = NULL;
    g_ui.label_cal_status = NULL;
    g_ui.label_cal_afe = NULL;
    g_ui.label_cal_raw_power = NULL;
    g_ui.label_cal_current_range = NULL;
    g_ui.label_cal_gain = NULL;
    g_ui.label_cal_points = NULL;
    memset(g_ui.btn_cal_range, 0, sizeof(g_ui.btn_cal_range));
    g_ui.wave_line = NULL;
    g_ui.bar_af = NULL;
    g_ui.bar_rssi = NULL;
    lv_obj_clean(g_ui.content);

    switch (page) {
    case PAGE_POWER:
        render_power_meter();
        break;
    case PAGE_HOME:
        render_home();
        break;
    case PAGE_RX:
        render_rx();
        break;
    case PAGE_SMS:
        render_sms();
        break;
    case PAGE_SETUP:
        render_setup();
        break;
    case PAGE_SCOPE:
        render_scope();
        break;
    default:
        break;
    }

    update_nav();
    update_top();
}

static void timer_event(lv_timer_t *timer)
{
    (void)timer;
    char buf[48];
    uint32_t sec = HAL_GetTick() / 1000U;
    uint32_t h = sec / 3600U;
    uint32_t m = (sec % 3600U) / 60U;
    uint32_t s = sec % 60U;

    if (g_ui.label_uptime != NULL) {
        snprintf(buf, sizeof(buf), "%02lu:%02lu:%02lu",
                 (unsigned long)h,
                 (unsigned long)m,
                 (unsigned long)s);
        lv_label_set_text(g_ui.label_uptime, buf);
    }

