lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    if (g_ui.label_status != NULL) {
        snprintf(buf, sizeof(buf), "RSSI %ddBm  AF %u%%",
                 (int)g_ui.state.rssi_dbm,
                 g_ui.state.af_level);
        lv_label_set_text(g_ui.label_status, buf);
    }

    update_top();
}

void slave_ui_create(lv_obj_t *parent)
{
    int32_t sw;
    int32_t sh;

    memset(&g_ui, 0, sizeof(g_ui));
    g_ui.root = parent;
    g_ui.state.station_id = 3U;
    g_ui.state.group_enabled = true;
    g_ui.state.rssi_dbm = -96;
    g_ui.state.af_level = 0U;
    g_ui.state.volume = 65U;
    g_ui.state.squelch = 35U;
    g_ui.state.battery_mv = 7400U;
    g_ui.state.battery_percent = 84U;
    g_ui.state.last_sender = 0U;
    snprintf(g_ui.state.pynq_status, sizeof(g_ui.state.pynq_status), "BOOT WAIT");
    snprintf(g_ui.state.capture_state, sizeof(g_ui.state.capture_state), "IDLE");
    snprintf(g_ui.state.test_result, sizeof(g_ui.state.test_result), "--");
    g_ui.state.wave_min = 0U;
    g_ui.state.wave_max = ADC_FULL_SCALE;
    g_ui.state.wave_avg = ADC_FULL_SCALE / 2U;
    g_ui.state.wave_pp_mv = ADC_REF_MV;
    g_ui.state.wave_abs_sample = 0U;
    g_ui.state.wave_last_cross_x100 = 0U;
    g_ui.state.wave_above_high = false;
    pm_set_display_mode(g_pm_start_display_mode);
    reset_frequency_display();

    for (uint16_t i = 0; i < WAVE_POINT_COUNT; i++) {
        g_ui.wave_points[i].x = (int32_t)((i * 756U) / (WAVE_POINT_COUNT - 1U));
        g_ui.wave_points[i].y = 105;
    }

    lv_obj_clean(parent);
    lv_obj_clear_flag(parent, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_bg_color(parent, C_BG, 0);
    lv_obj_set_style_pad_all(parent, 0, 0);

    sw = lv_obj_get_width(parent);
    sh = lv_obj_get_height(parent);
    if (sw <= 0) {
        sw = 800;
    }
    if (sh <= 0) {
        sh = 480;
    }

    /* The legacy radio pages above remain in the binary for reference, but this
     * product exposes only the power-meter screen: no hidden navigation layer. */
    g_ui.content = make_obj(parent, 0, 0, sw, sh, C_BG);

    lv_timer_create(timer_event, 250, NULL);
    lv_timer_create(update_power_meter_ui, 100, NULL);
    render_page(PAGE_POWER);
}

void slave_ui_set_power_meter_display_mode(uint8_t display_mode)
{
    if (display_mode > PM_DISPLAY_MODE_DBM) { return; }
    g_pm_start_display_mode = (pm_display_mode_t)display_mode;
    pm_set_display_mode(g_pm_start_display_mode);
    update_power_meter_ui(NULL);
}

void slave_ui_set_command_callback(void (*callback)(const char *command))
{
    g_command_callback = callback;
}

void slave_ui_set_pynq_status(const char *status)
{
    if (status == NULL) {
        status = "";
    }
    snprintf(g_ui.state.pynq_status, sizeof(g_ui.state.pynq_status), "%s", status);
    update_pynq_labels();
}

void slave_ui_set_test_result(const char *result)
{
    if (result == NULL) {
        result = "";
    }
    snprintf(g_ui.state.test_result, sizeof(g_ui.state.test_result), "%s", result);
    update_pynq_labels();
}

void slave_ui_set_capture_state(const char *state)
{
    if (state == NULL) {
        state = "";
    }
    snprintf(g_ui.state.capture_state, sizeof(g_ui.state.capture_state), "%s", state);
    update_pynq_labels();
}

void slave_ui_append_log(const char *line)
{
    if (line == NULL || line[0] == '\0') {
        return;
    }

    if (g_ui.state.log_count < PYNQ_LOG_LINES) {
        g_ui.state.log_count++;
    } else {
        memmove(g_ui.state.log_lines,
                &g_ui.state.log_lines[1],
                (PYNQ_LOG_LINES - 1U) * PYNQ_LOG_LINE_MAX);
    }

    snprintf(g_ui.state.log_lines[g_ui.state.log_count - 1U],
             PYNQ_LOG_LINE_MAX,
             "%s",
             line);
    update_pynq_labels();
}

void slave_ui_set_rx_state(bool carrier_detected,
                           bool selected_call,
                           bool group_call,
                           int16_t rssi_dbm,
                           uint8_t af_level)
{
    g_ui.state.carrier_detected = carrier_detected;
    g_ui.state.selected_call = selected_call;
    g_ui.state.group_call = group_call;
    g_ui.state.rssi_dbm = rssi_dbm;
    g_ui.state.af_level = af_level > 100U ? 100U : af_level;
    update_top();
}

void slave_ui_set_sms(const char *text, uint8_t sender_id, bool group_call)
{
    if (text == NULL) {
        text = "";
    }

    /* ===== Address filter =====
     * Group call (sender_id == 0xFF): ALWAYS accept, regardless of group_enabled.
     * Normal call: only accept if sender_id matches local station_id.
     */
    if (sender_id != 0xFFU && sender_id != g_ui.state.station_id) {
        char drop_msg[96];
        snprintf(drop_msg, sizeof(drop_msg), "DROP S%u: %s", sender_id,
                 text[0] ? text : "(empty)");
        slave_ui_append_log(drop_msg);
        return;
    }
    /* ===== End address filter ===== */

    snprintf(g_ui.state.sms_text, sizeof(g_ui.state.sms_text), "%s", text);
    g_ui.state.last_sender = (sender_id == 0xFFU) ? 0U : (sender_id % SLAVE_STATION_COUNT);
    g_ui.state.group_call = group_call;
    g_ui.state.packet_count++;
    g_ui.state.carrier_detected = true;
    g_ui.state.selected_call = true;

    /* Visible feedback: update capture_state so user knows SMS was received */
    snprintf(g_ui.state.capture_state, sizeof(g_ui.state.capture_state),
             "SMS rcvd S%u", sender_id == 0xFFU ? 0U : sender_id);
    update_top();

    /* Refresh current page so SMS appears immediately on any page */
    render_page(g_ui.page);
}

void slave_ui_set_battery(uint16_t millivolts, uint8_t percent)
{
    g_ui.state.battery_mv = millivolts;
    g_ui.state.battery_percent = percent > 100U ? 100U : percent;
    update_top();
}

void slave_ui_reset_waveform(void)
{
    reset_frequency_display();
    g_ui.state.wave_abs_sample = 0U;
    g_ui.state.wave_last_cross_x100 = 0U;
    g_ui.state.wave_above_high = false;
}

void slave_ui_set_waveform(const uint16_t *samples, uint16_t count)
{
    uint32_t sum = 0;
    uint16_t min_raw = ADC_FULL_SCALE;
    uint16_t max_raw = 0;
    uint32_t avg_raw;

    if (samples == NULL || count == 0U) {
        return;
    }

    for (uint16_t i = 0; i < count; i++) {
        uint16_t v = samples[i];
        if (v < min_raw) {
            min_raw = v;
        }
        if (v > max_raw) {
            max_raw = v;
        }
        sum += v;
    }

    avg_raw = sum / count;
    g_ui.state.wave_min = min_raw;
    g_ui.state.wave_max = max_raw;
    g_ui.state.wave_avg = (uint16_t)avg_raw;
    g_ui.state.wave_pp_mv = raw_to_mv(max_raw - min_raw);
    g_ui.state.wave_frame_count++;
    append_low_frequency_samples(samples, count);

#if WAVE_DRAW_ENABLE
    uint32_t span = (uint32_t)max_raw - min_raw;
    if (span < 64U) {
        span = 64U;
    }

    for (uint16_t i = 0; i < WAVE_POINT_COUNT; i++) {
        uint32_t src_index = ((uint32_t)i * (count - 1U)) / (WAVE_POINT_COUNT - 1U);
        uint16_t raw = samples[src_index];
        int32_t y = 204 - (int32_t)(((uint32_t)(raw - min_raw) * 198U) / span);

        if (y < 6) {
            y = 6;
        } else if (y > 204) {
            y = 204;
        }

        g_ui.wave_points[i].x = (int32_t)((i * 756U) / (WAVE_POINT_COUNT - 1U));
        g_ui.wave_points[i].y = y;
    }
#endif

