lalalalaui/stm32h7/Drivers/BSP/LVGL/slave_ui.c
    if (((uint32_t)max_raw - min_raw) >= WAVE_MIN_SPAN_RAW) {
        int32_t hyst = (int32_t)(((uint32_t)max_raw - min_raw) / 8U);
        int32_t high_thr = (int32_t)avg_raw + hyst;
        int32_t low_thr = (int32_t)avg_raw - hyst;

        for (uint16_t i = 1; i < count; i++) {
            int32_t prev = samples[i - 1U];
            int32_t cur = samples[i];

            if (g_ui.state.wave_above_high) {
                if (cur < low_thr) {
                    g_ui.state.wave_above_high = false;
                }
            } else if (cur >= high_thr) {
                uint32_t local_cross_x100;
                uint64_t abs_cross_x100;
                uint32_t den = (uint32_t)(cur - prev);

                if (den == 0U || prev >= (int32_t)avg_raw) {
                    local_cross_x100 = (uint32_t)i * 100U;
                } else {
                    uint32_t frac_x100 = (uint32_t)(((int32_t)avg_raw - prev) * 100 / (int32_t)den);
                    if (frac_x100 > 100U) {
                        frac_x100 = 100U;
                    }
                    local_cross_x100 = ((uint32_t)(i - 1U) * 100U) + frac_x100;
                }

                abs_cross_x100 = (g_ui.state.wave_abs_sample * 100U) + local_cross_x100;
                if (g_ui.state.wave_last_cross_x100 != 0U && abs_cross_x100 > g_ui.state.wave_last_cross_x100) {
                    uint64_t period_x100 = abs_cross_x100 - g_ui.state.wave_last_cross_x100;
                    uint32_t freq_x10 = (uint32_t)(((uint64_t)WAVE_SAMPLE_RATE_HZ * 1000ULL + (period_x100 / 2ULL)) / period_x100);

                    if (freq_x10 <= (WAVE_FREQ_MAX_HZ * 10U)) {
                        if (freq_x10 < (WAVE_LOW_FREQ_LIMIT_HZ * 10U)) {
                            uint32_t low_freq_x10 = estimate_low_frequency_x10(freq_x10);

                            if (low_freq_x10 != 0U) {
                                g_ui.state.wave_freq_calc_x10 = low_freq_x10;
                                g_ui.state.wave_freq_calc_valid = true;
                                push_frequency_sample(low_freq_x10);
                            }
                        } else if (g_ui.state.wave_freq_calc_valid) {
                            g_ui.state.wave_period_avg_x100 = 0U;
                            g_ui.state.wave_freq_calc_x10 = (g_ui.state.wave_freq_calc_x10 * 3U + freq_x10 + 2U) / 4U;
                            push_frequency_sample(g_ui.state.wave_freq_calc_x10);
                        } else {
                            g_ui.state.wave_period_avg_x100 = 0U;
                            g_ui.state.wave_freq_calc_x10 = freq_x10;
                            g_ui.state.wave_freq_calc_valid = true;
                            push_frequency_sample(g_ui.state.wave_freq_calc_x10);
                        }
                    }
                }

                g_ui.state.wave_last_cross_x100 = abs_cross_x100;
                g_ui.state.wave_above_high = true;
            }
        }
    } else {
        reset_frequency_display();
        g_ui.state.wave_above_high = false;
        g_ui.state.wave_last_cross_x100 = 0U;
    }

    g_ui.state.wave_abs_sample += count;
    update_waveform_obj();
}

uint8_t slave_ui_get_station_id(void)
{
    return g_ui.state.station_id;
}

bool slave_ui_group_enabled(void)
{
    return g_ui.state.group_enabled;
}
